[
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    244,
                    0,
                    443,
                    847
                ],
                "text": "THE LIBERATOR\nIS PUBLISHED\nEVERY FRIDAY MORNING,\nAT THE\nANTI-SLAVERY OFFICE, 21 CORNHILL.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    443,
                    0,
                    1099,
                    846
                ],
                "text": "Robert F. Wallcut, General Agent.\n\n(9 Terms—$2 50 per annum, in advance,\n\ni All remittances are to be made, and all letters\nrelating to the pecuniary concerns of the paper are to\nbe directed, (post parp,) to the General Agent.\n\n‘= Five copies will be sent to one address for TEN\n\nDOLLARS, if payment be made in advance.\n\nto\" Advertisements making less than a square in-\nsorted three times for 75 cts.—one square for $1 00.\n\ni The Agents of the American, Massachusetts,\nPennsylvania and Ohio Anti-Slavery Societies are au-\nthorised to receive subscriptions for the Liberator.\n\n \n\nFinancial Committee. — Francis Jackson, Exuis\nGray Lorine, Epwunp Quincy, SamuEeL PHILBRick,\nWenvett Puitues. [This Committee is responsible\nonly for the financial economy of the paper—not for\nany of its debts.]\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1099,
                    0,
                    1185,
                    846
                ],
                "text": " \n\n \n\n' WM. LLOYD GARRISON, EDI\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1185,
                    0,
                    1289,
                    846
                ],
                "text": " \n\n \n\nA VOL. XX. NO. 2.\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1289,
                    0,
                    1405,
                    846
                ],
                "text": "Z Refuge of Oppression.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1405,
                    0,
                    5297,
                    840
                ],
                "text": " \n\n \n\n \n\n   \n\neae subject of\n\n \n\nFrom the Glasgow Christian News.\nABOLITION AND INFIDELITY.\n\nThe Rev. John Guthrie, of Greenock, at the An-\nti-Slavery Meeting lately held in this city, made the\nfollowing statements :—\n\nThe resolation I have the honor to submit to this\nmeeting supposes that the Christians in America\ncannot be indifferent to the opinion formed of them\nby the Christians in Great Britain. This, surely, it\ns quite safe and sober toassume. Such populations\nns those of China and Japan can afford to be very\nyery indifferent to foreign opinion and influence;\nthey can afford to be so by dint of their comparative\nbarbarism, which leads them to barallsuch influence\nout. But it is not, and cannot be so with any civil-\nized nation—mnch less with America, which, be-\nsides being civilized, is to so large an extent Chris-\ntianized, and is, moreover, peculiarly impressible to\nBritish infinence, as a people of the same stock, and\nwho speak the same tongue. This last circumstance,\nviz., a community of language, is one of the most po-\ntent of all keys by which two nations can unlock\ntheir way to each other’s hearts, and that even\nthrough the most crooked and intricate wards of na-\ntional prejudice and prepossession. Such a key we\nhave in our noble’ language—and, O, what sympa-\nthies, what facilities, what persuasives, what glorious\nthoughts, embalmed in,our common literature in gen-\neral, in our Christianized literature in particular, does\nit vpen ap to Christians on each side of the Atlantic,\nfor all the ends of good influence, and that in the\nlargest s@ale ! In strictest harmony with these plain\nples are all the facts in the case ; for even a\nglance at American newspapers is sufficient\nto.show that at public meetings there held on the\nslavery, no small prominence is given to\nBritish opinion on the question, and considerable in-\nterest ana excitement are often thereby created.—\nSuch is the implement, which, in connection with\nothers, and especially in the spirit of faith, and love,\nand prayer, the ladies of this excellent Society wish\nBritlsh Christians to wield, with combined earnest-\nness and energy, on the American mind. My mo-\ntion makes mention of two tremendous evils, in the\neclipse of which, the American stars ‘burn dim and\nburn too often, alas! only to shed disastrous influ-\nence. The one of these is slavery, -on the evils,\nand horrors, and aggravated criminality of which—\nin a land especially ‘that boasts so much and often so\njustly of advancement—it is not necessary, after\nwhat we have heard, that I should detain you a sin-\ngle moment. The other evil is infidelity. How\nmelancholy to reflect that New England, the land of\nthe pilgrim fathers—the land that echoed, not merely\nto the tread and hum of industry, but to the prayers\nand the praises of as noble and_ vali: int-hearted men\nas ever suffered for the truth and right—should at\nthis hour be infested with schools of infidelity—to\nbe found here and there, like knots of serpents on its\nbosom—some of which are a bastard product of the\nphilosophy, falsely so called, that so much prevails in\nGermany, while others betray a socialistic origin,\nand agitate questions subversive alike of all reveal-\ned religion, and all civil government, with a zeal that\noften reaches the wildest and most furious fanaticism.\nA company of this latter description, whose head-\nquarters are Boston, have been long identified with\nthe anti-slavery movement in America. By some easy\nrefinements, their newspaper, with the infidel profani-\nties it ever and anon vomits forth, is shown, as often as\noccasion requires, to be not the formal and technical\norgan of the Anti-Siavery Society with which these\nBostonian gentlemen stand connected. It so hap-\npens, however, that abolition and infidelity are ad-\nvocated together, and not only so, are unblushingly\nidentified. The sweet waters and bitter flow from\nthe same fotintain, and become in consequence all\nbitter together. The gentlemen whom I refer to,\nare men of peace. They would not handle daggers\n—no, not they! They would not handle thei, but\nthey speak them; they writethem. Like tne apoca-\nlyptic monster, they have ‘horns like a lamb,’ bat\nthey ‘ speak like a dragon.’ They base abolitionism\non directly infidel principles. ‘hey propose infidel\nresolutions at public meetin They do their. ut-\nmost to identify Christianity and slavery ; and to in-\noculate with this poison every fugitive slave that\ncomes in their way; and, instead of contenting\nthemselves with striking at slavery through whatever\nchurches and other influences they can, without\nquestioning their motives or their honest desire to\nsee slavery abolished, we yet venture to say, that on\ntoo. many occasions they seein to be most in their el-\nement, when they aima blow, through slavery, at\nthe very heart of the Churches, and of that Holy Re-\nligion, of which, with all their faults, the American\nChurches are the shrines. If, then, these Churches\nwould only wash their hands of the fou! blot of sla-\nvery, the most envenomed arrows of infidelity would\nthat moment lose their point. [The speaker here\nstated some facts with a view to prove that the Am-\nerican Churches were doing much tore for the abo-\nlition of slavery than is commonly imagined.] Such\nis the drift of the motion, which, without further\ntrespassing on your time, I would respectfully pre-\nsent to this meeting. I would only, in my closing\nsentence, bespeak your support in behalf of this truly\nChristian and excellent Society. It interferes not\nwith others. It sets up no tests—-its existence, on\nthe contrary, is a protest against all such; for while\ni, aims zealously at the immediate abolition of all\nslavery, and wishes well to all who are engaged in\nthe same cause, though in different ways, it only\nclaims to conduct its efforts so as not to compromis\nprinciples dearer to us than life. We are no apolo-\ngists of the American Churches that are mixed up\nwith slavery. I, for my part, cold interchange no\nfellowship w itb them. But we wish to deal with\nthem in such a) (wer as not to aim at their subver-\nsion, but to rest ain, if possible, in the spirit of\nmeekness, and get them to realise the blessed prom-\nise :—‘If thou take away from the midst of thee the\nyoke, the putting forth of the finger, and speaking\nvanity ; and if thou draw out thy soul to the hungry,\nand satisfy the afflicted soul; then shall thy hght\nrisé in obscurity, and thy darkness be as the noon-\n\nday,’\n\n  \n\n \n\n \n\n \n\n \n\n   \n\n \n\n \n\n \n\n     \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n \n\n \n\n \n\n \n\n   \n\n \n\n   \n\n \n\n \n\n \n\n \n\n \n\nTHE COLONIZATION SPIRIT.\n{\" Here is a specimen of the spirit which animates\nthe Colonization crusade in this country\n\n \n\nIn every part of che United States, there is a broad\nand impassable line of demarcation between every\nman who has one drop of African blood in his veins,\nand every other class in the commanity. The hab-\nits, the feelings, all the prejudices of society—preju-\ndicos which neither refinement, nor argument, nor\nreligion itself, can sobdue—mark the people of color,\nbond or free, as the subjects of a degra pation inevi-\ntable and incurable. The African ins country\nbelongs by birth to the very lowest station in socie-\nty; and from that station he can never tise, be his\ntalents, his enterprise, his virtues what they may...\nThey constitate a class by themselves—a_ class out\nof which no individual can be elevated, and bejow\nwhich none can be depressed.—.4/rican Repository,\nvol. iv., pp 118, 119.\n\n \n\n \n\f"
            },
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    244,
                    847,
                    1099,
                    1440
                ],
                "text": " \n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1099,
                    846,
                    1183,
                    1440
                ],
                "text": " \n\n \n\nTOR.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1183,
                    846,
                    1289,
                    1440
                ],
                "text": " \n\n \n\nBO\n\nC\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1289,
                    846,
                    1419,
                    1439
                ],
                "text": "| Selections.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1419,
                    846,
                    3576,
                    1436
                ],
                "text": " \n\nFrom the Boston Christian (Universalist) Freeman.\nFLINGS FROM THE SOUTH.\n\nThe following is an editorial in the last Univer-\nsalist Herald :—\n\nWuere are tHe Puitanruropists? The Boston\nJournal has the following :—\n\n‘*Poverty.—In a room in an old shell of a house in\nShinbone Alley, which leads out of Endicott strect,\nthere resides, or rather exists, a woman named Cathe-\nrine Shean, with three children, who are entirely\ndestitute of focd and clothing, and have nothing but\nthe bare floor to sleep on, with two palm leaf mats\nfor their covering. An>ther woman named Elizabeth\nNelson, having four children, is also a tenant of the\nsame room, and in nearly as destitute circumstances\nas Mrs. Shean.’\n\nQuery.—If Northern fanatics have so much philan-\nthropy as they would have us believe, how does it\nhappen that helpless females are allowed to groan and\ndie under the pinchings of poverty in the midst of\nplenty?\n\nNow, we would respectfully ask the editor of the\nHerald, what he means by the word ‘fanatics’?\nDoes he design the epithet as descriptive of those.\nwho hold the unjyersal brotherhood of man and pa-\nternity of God; and the uncbristian character of ev-\nery institution which forcibly excludes men from the\nmeans of education, improvement and happiness;\nand the duty of all Christians to labor, by Christian\nmeans, to reform the evils that are in the world, the\ngreatest as well as the least? Does he design the\nepithet for such men as John Adams, Benjamin\nFranklin, Roger Sherman, Thomas Jefferson, Rob-\nert R. Livingston, and the host of other American\npatriarchs und statesmen, who labored to exclude\nfrom the American frame-work of government the\nright and power to make chattels of ‘MEN?? But\nwhy should he deem it a strange thing that men\nof such principles should not be able to prevent all\ncases of suffering and poverty in Boston? The two\nwomen spoken of in the above itein from the Boston\nJournal, are Irish women; and these people are\nflocking by thousands to our shores, and lodging in\nour city, in poverty and wretchedness, all of whom\nwe cannot take to our houses, if we would. Nor\ncan we know the particular condition of this class of\npeople in general, unless some particular circum-\nstance brings one and another to notice, for the rea-\nson that they are Catholics, kept by the influence\nof their creed and the policy of their priesthood as a\nseparate Hation within a nation. Nothing would'be |\nmore fearful to the Catholic hierarchy than the free |\nintermingling and intercourse of their people with\nProtestants, in social relations and sympathies. But\nthe priests, who control immense funds for sectari-\nan purposes, are ina way to know these cuses of suf-\nfering among their own people ; and they are thorough-\nly pro-slavery. There is no taint in them of the fa-\nnaticism of republicanism, They love the ‘pecaliar\ninstitutions’ of the South. Why, then, do they not\nrelieve their suffering sisters ?\n\nAnd then a majority of the citizens of Boston, at\nleast of men of property and standing, are pledged\nfriends of slavery. Hon. Rufus Choate declares that\nthere must not, there must not, there MUST not, be\nany ggitation against it; and he represents the pop-\nular sentiment of Boston, we think. Not that they\nwould have slavery created, if it were not in being.\nBut as it is, they would have it forever cherished.\nWhy, Bro. Herald, do not this class of our citizens\nrelieve all distresses, even before they become\nknown?\n\nIn conclusion, we have to say, that while we have\nno disposition to urge our Southern preachers to\nmake martyrdom certain by direct attacks on slavery,\nwe regret that they should officiously cater to the cor-\nrupt principles of oppressors, by contemptuous sneers\nat the principles of universal progress. We cannot\nregard this as the means by which they can acquire\nthe greatest honor and influence even in the South.\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    3576,
                    842,
                    5297,
                    1434
                ],
                "text": "From the Pennsylvania Freeman.\nMEETING TO HEAR MR. GIDDINGS.\n\nOn *Tuesday evening last, the large hall occupied\nby the Fair was densely crowded by an audience at-\ntracted chiefly by the announcement that that vete-\nran in the cause of Freedom, Hon. Josuua R. Giv-\npines, would make an address. The desire to see\nand hear the man who for so many years has breast-\ned with heroic firmness the storms of pro-slavery\nwrath which have swept over the Capital and through\nthe halls of Congress, induced many to attend, who\nare not often seen at anti-slavery meetings. There\nwas also a very general desire to hear the introduc-\ntory speech of Mr. Furness.\n\n{Mr. Furness having made some eloquent intro-\nductory remarks, in praise of Mr, Grppines]—\n\nMr. Gippines paesented himself, and as his man-\nly form and gray hairs became visible to the throng,\nhe was welcomed by a burst of enthusiastic ap-\nplause. He began his address by saying that he\nwas unaccustomed to pleading the anti-slavery cause\nin the presence of such an assembly as he now saw\nbefore him, His anti-slavery experience had been\nthat of a warrior in perpetual conflict with the ene-\nmy. Among the opponents of the cause, he was\nnever embarrassed—never ata loss for words; but\nin the presence of its friends, he scarcely knew what\ntosay., Mr. G. went on to describe the contrast be-\ntween the scene by which he was now surrounded\nand that presented only twenty-four hougs previous,\nwhen an American wife and mother had called on\nhim at his room in Washington, to beg him to do\nsomething to save her from an eterna] separation\nfrom her husband, who had been sold to a slave-\ntrader, and unless speedily redeemed by the inter-\nposition of warm-hearted friends, must go off to the\nfar South to drag out a miserable existence amidst\nthe horrors of the plantation. Although cases like\nthis were of frequent occurrence in Washington,\nand well known to those who made laws for the\npeople, they excited very little attrntion. During\nthe whole fourteen years he had been a member of\nCongress, he had never heard the Chaplain of the\nHouse offer a single prayer for the wretched victims\nof oppression who were confined in the prisons of\nthe District of Columbia, and who, torn away from\nkindred and friends, were ready to be shipped or\ndriven off in chains to the far South. Claiming to\nbe ministers of Him who came to proclaim liberty to\nthe captives and the opening of the prison to them\nthat were bound, they utterly excluded the slaves\nfrom the circle of their sympathies, On one occa-\nsion, several years ago, just after he had finished an\nanti-slavery speech in the House, he was told that\nsomebody wished to see him in the recess. On pass-\ning out the Chaplain, Mr. Tustin, introduced him\nto Rev. Dr. Wylie, of Scotland, a delegate to this\ncountry from the Free Chureh. The Doctor there-\n‘upon complimented bim for the anti-slavery speech\nwhich he (Mr. G.) had delivered ; in reply to which\nhe said, in the hearing of Mr. Tustin, ‘I have to do\nall the preaching and praying for the slaves in the\nHouse, for our Chaplain here, though he prays for\n\n \n\f"
            },
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    244,
                    1440,
                    1099,
                    2060
                ],
                "text": " \n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1099,
                    1440,
                    1180,
                    2059
                ],
                "text": " \n\n \n\nOUR COUNTRY IS THE WORLD-—OUR C\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1180,
                    1440,
                    1287,
                    2059
                ],
                "text": " \n\n \n\nPONS AAS S05 oR RTE\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1287,
                    1440,
                    3059,
                    2048
                ],
                "text": " \n\neveryuouy eise, never remember the wretched vie~\ntims in yonder slave prison. Dr. Wylie, turning to\nthe Ghaplain, with a most expressive glance, asked,\n‘Brother Tustin, is this true?’ Mr. T. was very\nmuch embarrassed, and could only stammer out, ‘ O,\nwe don’t think it would be prudent to make any allu-\nsion to the subject’ Mr. Giddings commented very\nseverely upon such conduct on the part of a man who\nclaimed to be a minister of Christ.\nMr. Giddings spoke about an hour and a half, dur-\ning which time he held the undivided attention of\n‘the audience. He reviewed the present aspects of\nthe anti-slavery cause as it stands connected with\n\ncurrent political events, and expressed the belief |\n\nthat the signs of the times were never more encour-\naging than now. Having been compelled to stand\nduring his address, we took no notes, and cannot\nundertake to present our readers even with a sketch\nof what fell from his lips. It is enough to say that\nhe thrilled the whole assembly by his fearless utter-\nance, and especially by his denunciations of the Fu-\ngitive Law, which he said he would trample under\nhis feet as an unholy thing, and an outrage upon the\nConstitution. His allusions to the Christiana affair,\nand to the efforts of the Government to hang peacea-\nble citizens of Pennsylvania as traitors, were raptu-\nrously applauded. He made no secret of his admi-\nration and approval of the conduct of the blacks in\nfighting for their freedom, and said that if be were a\nslave, he would take his liberty if he bad to walk\nover the dead bodies of slaveholders all the way\nfrom the borders of Kentucky to the Canada line,\nHe thanked God that so strong was the hostility to\nthis infernal law among the people of the Western\nReserve, ‘that the whole army and“navy of the\nUnited States could never enforce it there.\n\nWhen Mr. Giddings had concluded his address,\nLucretia Morr arose, and while expressing her\ndissent from those portions of his speech which\nsanctioned violence, thanked him, on behalf of the\nManagers of the Fair and of the abolitionists gen-\nerally, for his kindness in appearing upon our plat-\nform, and for his manly vindication of the rights of\nthe slave. She also expressed thanks to Josuva\nHurcatnson for his musical aid, which had afforded\nso much delight to the audience. Some one sug-\ngested that she ought not to forget Mr. Furness,\nwhen she answered, that he was so entirely one of us,\nthat a compliment to him would seem like a compli-\nment to ourselves. Messrs. Giddings and Hutchin-\nson were our guests, and therefore entitled to our\nthanks. This sentiment was warmly applauded.\n\nThe Cuarrman said he was glad to see that we\nhad with us, on the occasion, two of the Christiana\nTraitors; whereupon there was a ery, ‘Let them\ncome to the platform. In. this call Mr, Giddings\njoined, and Castyer Hanway and Evian Lewis,\nthough naturally reluctant to exhibit themselves, took\ntheir place on the platform amidst the most tempest-\nuous cheers. Mr. Giddings, standing between them,\nand taking them by the nand, said: ‘I declare to\nyou, my friends, that I am far prouder in being able\nto grasp the handscf these brave men, than | should\nbe to receive the applause of the mightiest prince\nthat ever trod the footstool of the Almighty” The\ncheers which followed this were tremendous.\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    3059,
                    1437,
                    4919,
                    2038
                ],
                "text": " \n\nFrom the same.\n\nTHE DREGS OF THE CUP.\n\nOur readers will doubtless be surprised to learn,\nthat Judge Kane has decided that the witnesses\nsummoned for the defence of Castner Hanway shall\nnot be paid by the United States! We did not think\nit possible that the men who have urged on these\nprosecutions for treason in the face of law and com-\nmon sense, and in a spirit disgraceful to the age,\ncould possibly do any thing, that would excite our\nsurprise ; but this act of superlative meanness ex-\ncites our amazement as well as indignation. Judge\nGrier, when his attention was first called to the\nsubject, admitted distinctly that the Government\nwas bound to pay the witnesses, but as some of his\nerders had been reviewed by the officers of the\nTreasury at Wsshington, he did not wish to act in\nthe case, and would leave it to bis brother Kane.\nThe qnestion cime up for argument on Friday last.\nMr. Ashmead resisted the payment of the witnesses,\nand Messrs. Read and Cuyler contended manfully\nagainst the meannéss and injustice of refusing to\npay them ; but, as we understand the matter, Judge\nKane, in the exercise of a discretion which the law\ngives him, decided that they should not be paid! It\nis not pretended, we believe, that the law required\nsuch a decision, though it is contended that it did not\nforbid it. But, independent ofall legal technicalities,\njust consider how base it is, on the part of the Gov-\nernment, to compel Castner Hanway to pay his own\nwitnesses. He had been charged, as the facts ex-\nhibited during the trial fully proved, with an offence\nof which he was entirely innocent—an offence, too,\nthe penalty of which is death. He had spent three\nmonths in prison upon a charge which no intelligent\nlawyer, whose brains were not utterly obfuscated\nby the sorceries of the Slave Power, could one mo-\nment expect to prove. A poor man, dependent upon\nhis labor for the support of his family, he had been\ndenied bail, and thus not only cut off from all op-\nportunity of earning his bread, but subjected to se-\nvere losses from the interruption of his business.\nHis health, too, had suffered severely from the un-\nwholesome air of the prison. Afier enduring all\nthis, and after demonstrating his entire innocence\nof the charge brought against him, the Court had\nthe meanness to subject him to the liability of toiling\nfor years to pay the witnesses who had been suin-\nmoned to testify in his behalf. And Mr. Ashmead\neven had the effrontery to insist that he had been ac-\nquitted only on a mere technicality—that he was\nguilty in fact, though not in form!\n\nThis is an outrage upon justice, of which we find\nit difficult to speak with any degree of calmness.\n\nWhile Castner Hanway, (as a punishment, we sup-\npose, for not being guilty of treason when the Gov-\nernment wanted a victim!) is compelled to pay his\nwitnesses, even though it shall make him a beggar,\nMr. Ashmead is allowed to put his hand in Uncle\nSam’s purse not only for his own fees, but for the\naccommadation of any of the slave-catching tribe\nwhom it was his pleasure to summon to Philadelphia\nduring the trial. The Rey. Mr. Gorsuch, son of the\nman who was killed at Christiana, who knew noth-\ning whatever of the circumstances, and who was not\neven put upon the stand, was accommodated by Mr.\nAshmead with a subpena, to enable him to remain\nin Philadelphia, at the expense of the United States,\nduoing the progress of the trial. How long will\ninjustice like this be toJerated in Pennsylvania ?\n\n \n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    4919,
                    1434,
                    5297,
                    2036
                ],
                "text": "From the Wisconsin Telegraph.\nTHE CHRISTIANA TREASON TRIAL\nENDED.\n\nThis solemn farce, which has been carried on un-\nder the approval of the Administration, has at last\nended. Ended in the acquittal of the prisoners—\nended inthe defeat of the Government—ended in\nthe defeat of the Fugitive Slave Law—and ended in\nthe triumph of the human over the diabolical princi-\nple among men.\n\nCastner Hanway, one of the few whites who was\nlooking on, when the blacks so nobly and religious-\n\f"
            },
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    244,
                    2059,
                    1097,
                    2639
                ],
                "text": " \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1097,
                    2060,
                    1180,
                    2639
                ],
                "text": " \n\n \n\nOUNTRYMEN ARE ALL MANKIND.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1180,
                    2059,
                    1287,
                    2639
                ],
                "text": " \n\n \n\nAY, JANUARY 9,\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1287,
                    2059,
                    2308,
                    2636
                ],
                "text": " \n \n \n   \n\nrliberly against tne kianappers, was\nark of the yelping and infernal pack\nbe Treason! Treason! at his\nels,\nHanway was tried on the new definition of trea-\non set up by Webster, Curtis, Lunt & Co., of Sha-\nlrach-hunting memory. It was a new definition, and\nvould not stand the authorities. Noah Webster\nind Daniel did not agree, and) Daniel gets beat—\nSo much for the new definition. It was supposed\nhat the Constitution had long ago defined what trea-\non was, and this verdict has proved that the suppo-\nition was correct. }\n\nThe Administration has got out of this affair pret-\ny well. How wonld they have|got outy if those\nersons had been convicted ? TK is more difficult\no tell. And although this trial may not have been\nlecided to please the getters-up offthe Fugitive Slave\nsaw, yet the decision will help them out of a great\njeal of trouble which would have been engendered if\nhey had been convicted. For who supposes that.\nhese men would have ever been suffered to have\neen hung by the neck for refusing to assist in kid-\napping human beings—even if this refusal had\neen called treason by the highest Court in the\nand ?\n\nLet this issue have been once made, and there\nvould have been no Jack of treason cases—clearly\nefined constitutional cases to boot. Such a decis-\non would have caused a revolution that would have\nettled the Fugitive Slave Law question, and the\nuestion of Slavery in this Republic at the same time’\n\nTt has taken weeks of time, and thousands of dol-\nurs of the public money, to prove that to be human\ns not treasonable—and, thank God, revolutions never\n‘o backwards—this question in this republic will\not haye to be settled again.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    2308,
                    2053,
                    3386,
                    2633
                ],
                "text": "RELIGIOUS ANTI-SLAVERY CONVEN-\nTION IN MAINE.\n\nThe undersigned hereby invite their brethren of\nI] denomination in the State, to meet in Convention\nit Augusta, Tuesday and Wednesday, Jan. 20 and\n»1,1852, to consider what duties the Word and Provi-\nlence of God impose upon us in reference to Slavery\nn our country.\n\nWhilst much has been done against this great evil\nind sin, in denominational and other forms, we be-\nieve there are solemn obligations yet undischarged,\nind that great good may result, in the present at-\nitude of affuirs, from embodying the religious Anti-\nslavery sentiment of the State, giving truth a more\nffective utterance, and uniting our prayers and ef-\norts in such modes of action as the gospel may both\nanction and demand.\n\nProf. George Shepard, Bangor; Pres. David N.\nSheldon, Waterville; Prof. Calvin E. Stowe, Bow-\nloin College; Profs. J. T. Champlin and J. R.\nsoomis, Waterville College; Rev. C- D. Pillsbury,\nsangor; Rey. Rufus P. Cutler, Portland; Rev. Benj.\n). Peck, do; Rev. Stephen Thurston, Searsport ;\ntev. Dexter Waterman, Unity; Rev. S. L. Cald-\nvell, Bangor; Rev. C. W. Morse. Portland; Rev.\nIben’r Knowltan, ‘Montville; Rev. W. F. Fartington,\nortland; Rev. George B. Little, Bangor; Rev. R.\n3. Thurston, Waterville; Rev. Wm. H. Hadley,\nortland; Rev. Wm. B: Hayden, do; Rev. J. R.\nscott, do; Rev. Samuel E. Brown, do; Rev. Mark\nt. Hopkins, Searsport ; Rev. J. B. Foster, Ed. Zion’s\n\\dvocate ; Rev. C. O. Libby, Scarboro; Rev. J. M.\nailey, Buxton; Rev. Win. McDonald, Biddeford ;\ntev. Joseph Ricker, Belfast; Rev. D. 'B. Randall,\nrorham; Rev. Philip Weaver, Bangor; Rev. Sylves-\ner Judd, Augusta; Rev. A. N. Freeman, Portland;\ntev. John Wilder, Falmouth; Rev. C. C. Cone,\nSaco; Rev. Oren B. Cheney, Lebanon; Rev. Aaron\n‘anderson, Portland; Rev. J. R. French, Seameu’s\nShaplain.\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    3386,
                    2047,
                    5297,
                    2629
                ],
                "text": "From the London Morning Advertiser.\nWILL KOSSUTH BE SAFE IN AMERICA ?\n\nTo rue Eprror:\n\nSrr—Your generous advocacy of Kossuth, his na-\ntion, and his cause, has been consistent with your\nadvocacy of civil, religious, and personai liberty\neverywhere. You foretold for him an enthusiastic\nreception in England, and the result has surpassed\niny thing you could have anticipated. His welcome\nhas been hearty, spontaneous, and multitudinous, be-\nyond any weleome ever before extended in England\n(0 a foreigner, without rank, title, government favor,\nor court patronage. In Manchester [ saw him, when,\neven according to the J'%mes’ reporter, 200,000 peo-\nple turned ont to meet him. I was told by another\nreporter, (not from the T%mes,) on the same occasion,\nhat the welcome he then received was fully as cor-\nJjal as that accorded to our justly popular Sovereign\nherself,\n\nKossuth’s name is now among our household\nwords. { will venture to say, that within the last\nmonth it has been ten times in our hearts and on our\n‘ips, for once that we have thought or spoken of any\nother public man. He is the symbol of the trust\nind Jove of a gallant but down-trodden people.\nHis cause is felt to be ourown. Though houseless,\nhomeless, and bereft of political power, his moral\ninfluence is prodigious, We know that all the des-\npots in Europe tremble at his name. We know that\nhe unbought love and sympathies of Great Britain\nhave added immensely to his influence and his im-\nportance,\n\nWell, then, he is to sail for America to-morrow. |\nHe will, doubtless, be received with great pomp and |\ncircumstance by the government, and with hearty\nenthusiasm by millions in the great republic. I re-\noice in the freedom of America, 1 rejoice that she\nis the asylum. of millions from the old countries of\nEurope, and especially my own, who find «bandance\nind comfort there, which no industry could secure\nto them under the feudal institutions and bad land\njaws in their native land. Bat I know that if Amer-\n2a has great privileges, she is also a country of ter-\nible oppressions and gigantic crimes. I know there\niS no country where so many mean men do the cru-\nllest and wickedest things for the sake of money.\nhe slaves in America are nearly as numerous as\nthe Magyars. They are held by the people of half\nthe States, the slave States, in a condition so strip-\nped of civil, religious, and personal rights, that the\nRussian serfs and the very Neapolitans are happy\nin comparison. If they escape into the free States,\noe they maids, wives, mothers, little children, or old\nnen, it matters not. There are thousands ‘in the\nree States, who say the Union must be preserved at\niny price, and there are multitudes more, so callous\nfo all shame, so athirst for money, that they are\nready ata call to play the doubie part of Judas and\nhe bloodhound for a very trifling consideration in\nnard cash. Thus, owing to the slave system, and\nthe assumed political necessity of maintaining it, in\norder that the Union may ,be held together—of do-\ning the wickedest. meanest, most abominable acts of\n‘reachery and cruelty for the direct love of money,\nor the maintenance of a detestable compact—it\ncomes to pass that an obtuseness of moral feeling, a\nblindness. to the clearest requisitions of Christ and\nhumanity prevail, even in the free States, which are\nnot surpassed or equalled in Russia, in Naples, or in\nDahomey.\n\nThis being the simple fact, I ask, ‘Is Kossuth\nsafe in the United States?’ I do not donbt that he\n\n \n\f"
            },
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    244,
                    2639,
                    1095,
                    3229
                ],
                "text": " \n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1095,
                    2639,
                    1180,
                    3229
                ],
                "text": " \n\nJ.B. YER\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1180,
                    2639,
                    1285,
                    3229
                ],
                "text": "1852.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1285,
                    2639,
                    2449,
                    3230
                ],
                "text": "will ve warmty welcomed py millions or aisinterest-\nec, sympathizing, generous hearts there, as well as\nhere. That the slaveholders and their tools—Fill-\nmore, the President ; Cass, the rank and zealous up-\nholder of slavery throughout the world; Clay, him-\nself a slaveholder; and Webster, that recreant De-\nmosthenes of America—that all these will welcome\nhim, in order to cover their own mora) loathsoine-\n‘ness, by the glory of his name, and to * make capi-\ntal out of him, I do not doubt. But then the slave-\nholders of New York, Philadelphia and Boston—the\nTukeys, the Curtises, all the base tools of the slave-\nholder, who are ready to betray anybody fora bribe;\nthe Ministers of the Gospel, (?) who proclaim their\nreadiness to see their own mothers go into slavery\nfor the maintenance of the Union; I would like to\nknow, is Kossuth safe from these ? They have sold\ntheir own souls. Woald they hesitate to kidnap and\nsell Kossuth? Is he not a fugitive—the greatest,\nmost marked, and most valuable of all living fugi-\ntives ? What would not Nicholas, or Francis Joseph\ngive to have Kossuth in his hands? They would\ngladly reward his capture with the price of the\nbrightest jewels in their crown, or the ransom of a\nprovince. [am sure this thing is worth looking at.\nThe United States are full of men whose talent,\nreadiness and pluck are surpassed only by their vil-\nlany, and for the sake of a stupendous reward, the\nhunters of women and children, the professional be-\ntrayers of innocence to pollution, and mankind to\nthe whip, will not hesitate, if the opportunity offers,\nto secure Kossuth, hide him, hurry hin on board one\nof their slave-trading Baltimore clippers, and make\nsail with him to St. Petersburg, Trieste, or some\nother Austrian or Russian port, where their reward\nwould be a as their infamy is unfathomable.\n\nSubmitting this shocking and very possible con-\ntingency to your consideration and that of your rea-\nders,\n\nI reman, respectfully yours,\nRICHARD D, WEBB.\nDublin, Nov. 19, 1851.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    2449,
                    2636,
                    5297,
                    3232
                ],
                "text": "From Frederick Douglass’s Paper.\nLETTER PROM WILLIAM G. ALLEN.\n\nFrepericx Doverass, Ese.—Dear Sirn:—You\nhave seen the address of the colored people of New\nYork city to Kossuth. What a stupendously fool-\nish thing! Nota word of their own wrongs—their\nsofferings—their enslavement ;—no point, no direct-\nness, no nothing, except the mere rhetoric. Pal-\naver, the whole of it; and to cap the climax of ab-\nsurdities, the address winds up with the assurance to\nthe Hungarian, that, on the day of giving, they (the\ncolored people) will be on hand with at least the\n* widow’s mite, if no more. Where did mortal man\never read of such folly as this before? Just as\nthough, if the colored people are to invest money\nfor the benefit of the oppressed, justice, consistency,\nand the commonest self-respect, do not require that\nsuch money should be expended in some way for\nthe benefit of the four millions in our own land who\nare ground to the dust in chains and slavery, and\nthe tens of thousands of others, who, by cruel laws\nand customs are kept in poverty and degradation.\n\nThe men who wrote that address are not fools,\nNo equal number of men ia the Union can present a\ngreater amount of native intellect and talent; and\nin education and accomplishments, some of the mem-\nbers of that committee are by no. means inferior to\nthe most favored of their oppressors. How much\nthe more guilty then are they! I cannot let them\ngo gently by. Though no other colored man should\nspeak out, I, for one, will do so; and Jet it be known,\nthat there is at least one of the oppressed in Ameri-\nca, whose feelings that address, lacking, as it does,\nso much of vitality, does not represent, and who can\nfind next to nothing to applaud in so ridiculous a\nperformance.\n\nThe address, milk and water as it was, failed to\nmake any impression upon Kossuth ; and, as a mat-\nter of course, he treated those who presented it with\nthe most withering contempt. ‘ Gentlemen, the time\nfor addresses is past, and the time for action has come.’\nIf that isn’t ‘summary? I should like to know what\nis? Poor men! how they must have felt as they\nsneaked away from his presence!\n\nKossuth is a man of matchless power of mind.\nHe sets aside all orators, whether of ancient or\nmodern date. He is positively an intellectual won-\nder. Nevertheless, he has proved himself not only\nmortal man, but capable of cherishing views and feel-\nings which are not in accordance with the laws that\nlie at the basis of our common humanity, and which\nbind us together in one bond of general brotherhood.\n\nKossuth is not asked to turn anti-slavery Jécturer,\nthongh this is what Wright of the Commonwealth\ncharges upon Wm. Lloyd Garrison. He is not ask-\ned to turn aside from the Hungarian cause, or to\ndivide his energies between the cause of the Ameri-\ncan slave, and that of the Hungarian oppressed.\nNobody but a foo! would ask that. He is simply\nasked to do nothing or say nothing while here, which\nwould imply that he regarded the liberty of the\nAmerican black man as Jess sacred than that of the\nHungarian white man: in other words, be is simply\nasked to see that there does exist among us such an\ninstitution as American Slavery, and to utter to the\nAmericans, face to face, one burning rebuke by way\nof its condemnation. Do less than this, he could\nnot, and maintain his integrity; and doing less than\nthis, it is my prayer at least, that such ‘Apostles of\nliberty’? as he, may be fewer than ever were angels’\nvisits, and a great deal farther between.\n\n‘My principle, says Kossuth, in his card, ‘in this\nrespect 13, that every nation has the sovereign right to\ndispose of ils own domestic affuirs, without any for-\neign interference ; that I therefore shall not meddle\nwith any domestic concerns of the United States.\nFour millions ofe Africans and their descendants,\ntherefore, may toil on ina worse slavery than ever\nthe Hungarian knew ; and, for all Kossuth cares, the\ndevil catch them at last. ‘This is benevolence, sure-\nly! Why comes he here to incuce us to meddle with\nthe ‘domestic concerns’ of Austria? If the enslave-\nment of the blacks to the whites in this country be\na “domestic concern, then the oppressed condition\nof the Hungarians to the Austrians is a ‘domestic\nconcern.” And if, being a ‘domestic concern,’ the\nenslavement of the one class be outside of his no-\ntice. then why, with equal justice, should not the op-\npressed condition of the other class, being a ‘domes-\ntic concern,’ be outside of our notice? O, consis-\ntency, thou art a jewel!—and, besides, I ate\nhypocrisy.\n\nThe plain-trath is, Kogguth’s disclaimer will get\nhim more money; but it known unto him, that\nmoney gotten thus will curse him, and not bless him.\n\nSome men I know at this point read us lectures on\n‘Common Sense.’ Let them read on. [acknowledge\nno common sense which is in contravention of the\nlaw of rectitude.\n\nMuch better would it have been for the cause of\nfreedom the world over, had Kossuth maintained his\nintegrity. One word from him to this people would\nhave startled this nation into a sense of propriety\nnever felt before; and would have given such an im-\npetus to the cause of freedom as would almost have\nenabled us to fix the very day when the good time\nshould come. What retards the cause of republican\nfreedom in Europe more than our abominable in-\n\n \n\n \n\f"
            },
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    244,
                    3229,
                    1095,
                    4104
                ],
                "text": "NO UNION WITH SLAVEHOLDERS!\n\n \n\n \n\nAND AN AGRE NT WITH HELL.’\n\n \n\n|\nTHE tf. 5: CONSTITUTION IS ‘A COVENANT WITH DEATH\ner Yes! it cannot be deni¢€@—the slavehohing\nlords of the South prescribed, as a condition of their\nassent to the Constitution, three special provisions to\n| secure the perpetuity of their dominion over their\nslaves The first was the immunity, for twenty years,\n| of preserving the African slave trade; the second was\nthe stipulation to surrender fugitive slaves—an en-\ngagement positively prohibited by the laws of God,\n| delivered from Sinai; and, thirdly, the exaction, fatal\nto the principles of popular representation, of a repre-\n| sentation for slaves—for articles of merchandize, under\nthe name of persons. . . To call government thus con-\nstituted a democracy, is to insult the understanding of\n_mankind. It is doubly tainted with the infection of\nriches and slavery. Its reciprocal operation upon the\n| government of the nation, is to establish an artificial\n| majority in the slave representation over that of the\nfree people, in the American Congress, and thereby\nto make the PRESERVATION, PROPAGATION\nAND PERPETUATION OF SLAVERY THE VI-\nTAL AND ANIMATING SPIRIT OF THE NA-\nTIONAL GOVERNMENT.’—Joun Quincy Apams\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1095,
                    3229,
                    1180,
                    4104
                ],
                "text": "Ne\n\nRINTON & SON, PRINTERS.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1180,
                    3229,
                    1282,
                    4104
                ],
                "text": " \n\nWIIOLE NO, 1096.\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1282,
                    3229,
                    1932,
                    4104
                ],
                "text": " \n\n \n\n \n\nconsistencies? Do not tyrants take courage at ou\nposition, and langh us to very scorn? Were we a\none with our professions, democracy could not lag in\nEurope. It would come quickly; and not only” sO,\nbut be a faet, fixed, firm, immovable.\n\nNo good comes of the spirit of compromise, and\ncompromising with right and duty. He who cannot\nread that fact in this country’s history, is quite too\nstupid to be endured, Do not wise men begin to fear\nthat unless we do something for slavery, soon slavery\nwill do something for us? And is this fear il)-found-\ned? Are they foolish who fear that slavery, in\ndestroying itself, may destroy the nation, and that in\na way the equal of which has never yet been written\nupon any page of human history ? But I forbear to\nsay more. May God help the weak; and give wia-\ndoin and power to those who are laboring to’ bring\nslavery and oppression to the dust, not-only in Ans-\ntria or Hungary, but wherever they may be found.\n\nFaithfully yours,\nWM. G. ALLEN.\n\nMcGrawvitte, N. Y., Dec. 30, 1851.\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    1932,
                    3229,
                    2709,
                    4104
                ],
                "text": " \n\nFrom the Commonwealth of Dee. 20.\nTHE ‘LIBERATOR’ AND HUNGARY.\n\nMr. Garrison, editor of the Liberator, has thrown\naway Kossuth. He [Garrison] is a most wonderful\nspendthrift of friends, both on bis own account and\nthat of the cause he advocates. But in this case, he\nseems to us guilty of something even worse than a\nwaste of that searce commodity. Kossuth, the fu-\ngitive hero, who abolished serfdom in his own coun-\ntry, and is the proclaimed friend of equal liberty\nbefore the law, for all races, has come to this’ lind of\npartial liberty and great wealth, to plead for his\ncountry, trodden under the iron heel of two ttterly\ndespotic, women-flogging empires. And now, be-\ncause he will not damage and utterly defeat this\nmission by turning anti-slavery lecturer, Mr. Garri-\n|son has not one word of sympathy for him, much\nless a dollar! Such madness is worthy of Bedlam.\nIt could not be extended by sending the hat to Hun-\ngary, and begging contributions to sustain the Labe-\nrator, and pay Mr. Garrison’s salary !\n\nKossuth has given all the proofs of sincerity in\nthe cause of human liberty which man could give,\n— quite as weighty ones as any living man on this\nside of the Atluntic has given. And for a champion\nof universal as well as impartial liberty, he has one\nimportant qualification, which his critic of the Libe-\nrator seems to lack, viz:—common sense.\n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    2709,
                    3230,
                    3558,
                    4104
                ],
                "text": " \n\nFrom the Providence Mirror.\nEOSSUTH.\n\nTt is not enough for Mr. Garrison, that Kossuth\nhas declared his hostility to slavery every where, in\nthe most emphatic manner, It is not enough that he\nhas already been denounced by. slaveholders as an\nincendiary, and threatened with prosecutions for\ntreason. It is not enough that in the American Con-\ngress, he is compared with George Thompson, the\nbosom friend of Mr. Garrison, It 1s not enough that\ntwenty-two Representatives of slave property voted\nagainst a resolution of welcome to him. O, no! It\nwould not be enough for Garrison, if he should say\nthat slavery was wrong, wicked and hypocritical,\nunless he could show his opposition to it in precisely\nthe way marked out by the editor of the Liberator,\nand his Boston clique of the American Anti-Slavery\nplatform. He must say, in answer to the delega-\ntions—‘ Your Constitntion is a covenant with death\nand an agreement with hell,’ and ‘ your American\nchurch is a brotherhood of thieves ;’ your politicians\nand your ministers are hypocrites and liars, and your\ngovernment is the most hypocritical on earth;’ and,\nabove all, he must add, ‘Great is the American An-\nti-Slavery Society, and Garrison is its prophet ;’ (or,\nperhaps more truly, ‘Great is the American Anti-\nSlavery Society, and i is Garrison’s profit.)\n\nIf he would say this, he might have a handful of\nfriends, as long as he would place himself at their\ndisposal, to be denounced when he turned from the\ndictator’s path,\n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    3558,
                    3230,
                    4592,
                    4104
                ],
                "text": " \n\nFrom the Cleveland True Democrat.\nEKOSSUTH.\n\nOne thing is plain, and that is, that he wil] allow\nno man, nor set of men, to draw him from the great\ncentral thought of his soul—the freedom of Hun-\ngary and Europe. And he is right. We trust he\nIl heed nothing, care for nothing, think of noth-\ning, which can be tortured into a desire, much less\npurpose, of taking part or meddling in the political\ndivisions of the day in our Jand.\n\nWe notice that some of our friends are anxious\nthat he should express himself on the special ques-\n|tion of freedom, Why should they be ? Is not his\nlife one eloquent defence of freedom? Is not his\nspirit fall of the fire of liberty? Are not his teach-\nings, and all his speech, and his very presence, a\nsanctified and glorious embodiment of the doctrine\nof human brotherhood? For the United States, for\nthe world, he stands far above the passions and petty\nschemes which cause the marshalling of parties and\nthe planning of contests, and the contests themselves,\nas one of the world’s best and purest master-spirits,\ntreading the path of a higher human freedom, and\npreparing the people every where to tread it with\nhim.\n\nThis is Kossuth’s position. From him, therefore,\nwe would ask no word for any party, whether that\nparty be for or against freedom. From him we would\nseek no expression, if we could surely get it, which\nwould cause him to favor this or that political divi-\nsion in our country. Let him plead for Hungary and\nher freedom, with his whale soul, as no other living\nman can, and he will do more for liberty, the world\nover, than he would by any other course. Let him\ndo that, untrammelled, and with every free syinpathy\ncentering round and in him, and he will do more for\nfreedom in our land than any American could ac-\ncomplish,\n\n \n \n    \n\n \n\f"
            }
        ]
    },
    {
        "issue_id": "5h741x962",
        "title": null,
        "subtitle": null,
        "images": [
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    4592,
                    3231,
                    5297,
                    4104
                ],
                "text": "From the Hartford Republican.\n\nGARRISON VS. KOSSUTH.\n\nKossuth bas not mentioned our ‘ precious domes-\ntic institution of Slavery,’ for he is here, not to oper-\nate as an anti-slavery lecturer, not to see and\ndenounce the ‘stains on our national character, but\nto plead the cause of Hungary,\n\nNo living man has given more abundant proof of\nsincere and self-sacrificing devotion to the cause\nof haman freedom, than “Kossuth. He has braved\nAustrian dungeons, spurned the blood-monéy of\nEuropean despotism, and under al] circumstances\nshown that purity, greatness, and heroism of soul,\nwhich commads universal admiration and makes him\nthe hope and joy of all those who lie prostrate and\nstruggling under the thrones of European despots,\nHis whole life is consistent. It speaks but one\nlanguage and has but one meaning.\n\nHis mission to this country is regulated by one\ncentral thought—the Freedom of Hungary. This\nis the work to which he is specially appointed by\nProvidence, He is among us to plead that cause.\nAnd we are glad to see him pursue his great ob-\nject with such steadiness and wisdom. His time\nhere is very short. Central Europe is fermenting\n\n   \n\n \n\n \n\f"
            },
            {
                "id": "5h741x97b",
                "filename": "5h741x962_5h741x97b.jpg",
                "coordinates": [
                    4592,
                    3231,
                    5298,
                    4104
                ],
                "text": "From the Hartford Republican.\n\nGARRISON VS. KOSSUTH.\n\nKossuth bas not mentioned our ‘ precious domes-\ntic institution of Slavery,’ for he is here, not to oper-\nate as an anti-slavery lecturer, not to see and\ndenounce the ‘stains on our national character, but\nto plead the cause of Hungary,\n\nNo living man has given more abundant proof of\nsincere and self-sacrificing devotion to the cause\nof haman freedom, than “Kossuth. He has braved\nAustrian dungeons, spurned the blood-monéy of\nEuropean despotism, and under al] circumstances\nshown that purity, greatness, and heroism of soul,\nwhich commads universal admiration and makes him\nthe hope and joy of all those who lie prostrate and\nstruggling under the thrones of European despots,\nHis whole life is consistent. It speaks but one\nlanguage and has but one meaning.\n\nHis mission to this country is regulated by one\ncentral thought—the Freedom of Hungary. This\nis the work to which he is specially appointed by\nProvidence, He is among us to plead that cause.\nAnd we are glad to see him pursue his great ob-\nject with such steadiness and wisdom. His time\nhere is very short. Central Europe is fermenting\n\n  \n\n   \n\n \n\n \n\f"
            }
        ]
    }
]